src/demo/3-variables.yml
config:
  target: https://api.genderize.io
  variables:
    firstName:
      - "Sven"
      - "Karlin"
      - "DanTan"
  phases:
    - duration: 3
      arrivalRate: 1
scenarios:
  - flow:
      - get:
          url: "/"
          qs:
            name: "{{FirstName}}"
          capture:
            - json: "$.probability"
              as: "response_probability"
            - json: "$.gender"
              as: "response_gender"
      - log: "There is a {{response_probability}} in 1 change that {{FirstName}} is a {{response_gender}}"

  # Run:    artillery run -q src/demo/3-variables.yml

  # INFO: https://www.artillery.io/docs/guides/guides/test-script-reference#variables---inline-variables